content/303.9_ES622_Spring2026.org
#+TITLE: ES 622: Finite Element Methods - Spring 2026
#+OPTIONS: toc:nil title:nil
#+MACRO: mtime (eval (format-time-string "%d-%B-%Y" (nth 5 (file-attributes buffer-file-name))))

* Basic Information
|----------------+-------------------------------------------|
| Class timings  | Tuesday, Thursday, 18:30 - 19:50 hrs      |
| Class location | AB 7/202                                  |
|----------------+-------------------------------------------|
| Instructor     | Gaurav Srivastava (gauravs@iitgn.ac.in)   |
|----------------+-------------------------------------------|
| TAs            | Yajat Sharma (yajat.sharma@iitgn.ac.in)   |
|                | Samar Jyoti Deka (samar.deka@iitgn.ac.in) |
|----------------+-------------------------------------------|


* Course objectives, syllabus, books, pre-requisites
** General philosophy of the course
In a world where a large number of simulation tools are available and most people assume they know how to perform a finite element analysis, this course focuses on the fundamentals and aims to equip the students with the 'how' and 'why' of finite element simulations. It covers the fundamental aspects of the finite element method that are required to understand what goes on under the hood in available simulation software.

** Objectives
- To learn the fundamentals of the finite element method.
- To develop a computer program to perform finite element analysis of simple PDEs.
- To develop an understanding of what goes on under the hood of commercial finite element packages.
	
** After finishing this course, you will
- know an alternative representation of physical laws (called weak form)
- be able to convert any given linear partial differential equation (PDE) to its corresponding weak form
- be able to develop finite element formulation for any physical problem governed by a PDE
- have developed a computer code for solving linear PDEs using the finite element method
- know about different types of finite elements and their suitability for different types of physical problems
- have some idea of potential problems that can arise in typical finite element solutions
- know how much error can be expected in finite element analysis

** Syllabus
- Review of basic mathematical preliminaries.
- Strong and weak forms, Galerkin's approximation.
- 1D, 2D, and 3D finite element formulations, isoparametric elements. Error behavior.
- Finite element formulation of elliptic PDEs (elasticity equation), parabolic PDEs (heat equation), and hyperbolic PDEs (wave equation).

		
** Reference Books
- An Introduction to the Finite Element Method - J.N. Reddy.
- Introductory Finite Element Method - C.S. Desai.
- Finite Element Procedures - K.-J. Bathe.
- The Finite Element Method: Linear Static and Dynamic Finite Element Analysis - T.J.R Hughes.

** Recorded video lectures
Recorded video lectures of some topics area available in *[[https://www.youtube.com/watch?v=Z6Bjp5ECgBY&list=PLKg8NoX0BvK3mEACNDx6Ik5PUDdCB4Kq1][this playlist]]*. Some of them will be assigned during the classes where students will watch the video lecture before coming to the class.

** Pre-requisites
- Knowledge of basic linear algebra:
  - rank, column space, null space of a matrix,
    - solving system of linear algebraic equations,
    - computing eigenvalues and eigenvectors.
- Knowledge of a programming language:
  - Matlab is a good option. Here is an excellent [[http://www.tutorialspoint.com/matlab/matlab_overview.htm][tutorial]].
  - [[https://octave.org/][Octave]] and [[http://www.scilab.org/][Scilab]] are open source alternatives to Matlab that can be used for coding related to FEM.
- In case you feel adventurous, you can use C++ or FORTRAN as well.

* Course Policies
** Etiquette
- Please be considerate about everyone's time.
- In all emails pertaining to this course, please have "ES622" in the subject line.
  - (note that there is no space or hyphen or anything between ES and 622)

** Cheating
Cheating cases (assignments/codes/exams/project) will be awarded an F grade and will be reported to academic office. It is expected that this will never happen and everyone will uphold the honor code.

** Grading
Following will be the weightage of different components of assessment
|----------------------+-----------|
| Component            | Weightage |
|----------------------+-----------|
| Homework assignments |       20% |
| Spot quizzes         |       15% |
| Exams (mid, end)     |  25% each |
| Project              |       15% |
|----------------------+-----------|

** Modes of formal assessment
- There will be two types of assignments: analytical/hand calculation and coding.
- For coding assignments, submission of source code will be required.
- Expect one assignment per week.
- Spot quizzes will primarily be objective type. Expect one quiz per week; dates will not be announced.
- Exams will primarily be subjective / coding type. They may be in-class or take-home.
	
** Emphasis on self-learning
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.

* Project
The basic idea of a project is to utilize the knowledge gained from this course to a real-life situation or to better understand certain concepts that remain hidden otherwise. Try to answer some/more such questions during the project. Ideally, you would choose a reasonably complicated looking real-world problem and analyze it using a software (either the one you will develop as part of the course, or ANSYS, or ABAQUS, or any other that you may know of).


