303.9_ES622_Spring2026.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-29 Thu 10:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ES 622: Finite Element Methods - Spring 2026</title>
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='gs_simple.css' />

</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content" class="content">

<div id="outline-container-org7df491b" class="outline-2">
<h2 id="org7df491b">Basic Information</h2>
<div class="outline-text-2" id="text-org7df491b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class timings</th>
<th scope="col" class="org-left">Tuesday, Thursday, 18:30 - 19:50 hrs</th>
</tr>

<tr>
<th scope="col" class="org-left">Class location</th>
<th scope="col" class="org-left">AB 7/202</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TAs</td>
<td class="org-left">Yajat Sharma (yajat.sharma@iitgn.ac.in)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Samar Jyoti Deka (samar.deka@iitgn.ac.in)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org7d0c340" class="outline-2">
<h2 id="org7d0c340">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-org7d0c340">
</div>
<div id="outline-container-org4316ba2" class="outline-3">
<h3 id="org4316ba2">General philosophy of the course</h3>
<div class="outline-text-3" id="text-org4316ba2">
<p>
In a world where a large number of simulation tools are available and most people assume they know how to perform a finite element analysis, this course focuses on the fundamentals and aims to equip the students with the 'how' and 'why' of finite element simulations. It covers the fundamental aspects of the finite element method that are required to understand what goes on under the hood in available simulation software.
</p>
</div>
</div>

<div id="outline-container-org891630a" class="outline-3">
<h3 id="org891630a">Objectives</h3>
<div class="outline-text-3" id="text-org891630a">
<ul class="org-ul">
<li>To learn the fundamentals of the finite element method.</li>
<li>To develop a computer program to perform finite element analysis of simple PDEs.</li>
<li>To develop an understanding of what goes on under the hood of commercial finite element packages.</li>
</ul>
</div>
</div>

<div id="outline-container-org3467cc8" class="outline-3">
<h3 id="org3467cc8">After finishing this course, you will</h3>
<div class="outline-text-3" id="text-org3467cc8">
<ul class="org-ul">
<li>know an alternative representation of physical laws (called weak form)</li>
<li>be able to convert any given linear partial differential equation (PDE) to its corresponding weak form</li>
<li>be able to develop finite element formulation for any physical problem governed by a PDE</li>
<li>have developed a computer code for solving linear PDEs using the finite element method</li>
<li>know about different types of finite elements and their suitability for different types of physical problems</li>
<li>have some idea of potential problems that can arise in typical finite element solutions</li>
<li>know how much error can be expected in finite element analysis</li>
</ul>
</div>
</div>

<div id="outline-container-org2533004" class="outline-3">
<h3 id="org2533004">Syllabus</h3>
<div class="outline-text-3" id="text-org2533004">
<ul class="org-ul">
<li>Review of basic mathematical preliminaries.</li>
<li>Strong and weak forms, Galerkin's approximation.</li>
<li>1D, 2D, and 3D finite element formulations, isoparametric elements. Error behavior.</li>
<li>Finite element formulation of elliptic PDEs (elasticity equation), parabolic PDEs (heat equation), and hyperbolic PDEs (wave equation).</li>
</ul>
</div>
</div>


<div id="outline-container-org2130db2" class="outline-3">
<h3 id="org2130db2">Reference Books</h3>
<div class="outline-text-3" id="text-org2130db2">
<ul class="org-ul">
<li>An Introduction to the Finite Element Method - J.N. Reddy.</li>
<li>Introductory Finite Element Method - C.S. Desai.</li>
<li>Finite Element Procedures - K.-J. Bathe.</li>
<li>The Finite Element Method: Linear Static and Dynamic Finite Element Analysis - T.J.R Hughes.</li>
</ul>
</div>
</div>

<div id="outline-container-org8f0fc34" class="outline-3">
<h3 id="org8f0fc34">Recorded video lectures</h3>
<div class="outline-text-3" id="text-org8f0fc34">
<p>
Recorded video lectures of some topics area available in <b><a href="https://www.youtube.com/watch?v=Z6Bjp5ECgBY&amp;list=PLKg8NoX0BvK3mEACNDx6Ik5PUDdCB4Kq1">this playlist</a></b>. Some of them will be assigned during the classes where students will watch the video lecture before coming to the class.
</p>
</div>
</div>

<div id="outline-container-org2c9982a" class="outline-3">
<h3 id="org2c9982a">Pre-requisites</h3>
<div class="outline-text-3" id="text-org2c9982a">
<ul class="org-ul">
<li>Knowledge of basic linear algebra:
<ul class="org-ul">
<li>rank, column space, null space of a matrix,
<ul class="org-ul">
<li>solving system of linear algebraic equations,</li>
<li>computing eigenvalues and eigenvectors.</li>
</ul></li>
</ul></li>
<li>Knowledge of a programming language:
<ul class="org-ul">
<li>Matlab is a good option. Here is an excellent <a href="http://www.tutorialspoint.com/matlab/matlab_overview.htm">tutorial</a>.</li>
<li><a href="https://octave.org/">Octave</a> and <a href="http://www.scilab.org/">Scilab</a> are open source alternatives to Matlab that can be used for coding related to FEM.</li>
</ul></li>
<li>In case you feel adventurous, you can use C++ or FORTRAN as well.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8caa469" class="outline-2">
<h2 id="org8caa469">Course Policies</h2>
<div class="outline-text-2" id="text-org8caa469">
</div>
<div id="outline-container-orgcddacf9" class="outline-3">
<h3 id="orgcddacf9">Etiquette</h3>
<div class="outline-text-3" id="text-orgcddacf9">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "ES622" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between ES and 622)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgda32886" class="outline-3">
<h3 id="orgda32886">Cheating</h3>
<div class="outline-text-3" id="text-orgda32886">
<p>
Cheating cases (assignments/codes/exams/project) will be awarded an F grade and will be reported to academic office. It is expected that this will never happen and everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-orgd0b66f4" class="outline-3">
<h3 id="orgd0b66f4">Grading</h3>
<div class="outline-text-3" id="text-orgd0b66f4">
<p>
Following will be the weightage of different components of assessment
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-right">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-right">20%</td>
</tr>

<tr>
<td class="org-left">Spot quizzes</td>
<td class="org-right">15%</td>
</tr>

<tr>
<td class="org-left">Exams (mid, end)</td>
<td class="org-right">25% each</td>
</tr>

<tr>
<td class="org-left">Project</td>
<td class="org-right">15%</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd8f8026" class="outline-3">
<h3 id="orgd8f8026">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-orgd8f8026">
<ul class="org-ul">
<li>There will be two types of assignments: analytical/hand calculation and coding.</li>
<li>For coding assignments, submission of source code will be required.</li>
<li>Expect one assignment per week.</li>
<li>Spot quizzes will primarily be objective type. Expect one quiz per week; dates will not be announced.</li>
<li>Exams will primarily be subjective / coding type. They may be in-class or take-home.</li>
</ul>
</div>
</div>

<div id="outline-container-org12d6ef2" class="outline-3">
<h3 id="org12d6ef2">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-org12d6ef2">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdb9eb05" class="outline-2">
<h2 id="orgdb9eb05">Project</h2>
<div class="outline-text-2" id="text-orgdb9eb05">
<p>
The basic idea of a project is to utilize the knowledge gained from this course to a real-life situation or to better understand certain concepts that remain hidden otherwise. Try to answer some/more such questions during the project. Ideally, you would choose a reasonably complicated looking real-world problem and analyze it using a software (either the one you will develop as part of the course, or ANSYS, or ABAQUS, or any other that you may know of).
</p>
</div>
