content/303.9_ES622_Spring2026.org
** Timeline
Project is to be done in groups of not more than 3. Following timeline must be adhered to for all submissions. (this timeline will be updated during the first week of classes)
#+ATTR_LATEX: :environment longtable :align lp{0.7\textwidth}l
|--------+-------------------------------------------------------------------------------------------------------+-------|
| Date   | Task                                                                                                  | Marks |
|--------+-------------------------------------------------------------------------------------------------------+-------|
| Feb 5 | Formation of groups, identification of topic. SUBMIT group details and abstract of proposed work.     |    10 |
|--------+-------------------------------------------------------------------------------------------------------+-------|
| Feb 19 | Feedback from instructor about project topics                                                         |  -10* |
|--------+-------------------------------------------------------------------------------------------------------+-------|
| Mar 19 | SUBMIT 2-3 page detailed report discussing overall approach, idealizations, etc. required for project |    20 |
|--------+-------------------------------------------------------------------------------------------------------+-------|
| Apr 16 | Project presentations (one per group)                                                                 |    30 |
|--------+-------------------------------------------------------------------------------------------------------+-------|
| Apr 18 | SUBMIT final report.                                                                                  |    40 |
|--------+-------------------------------------------------------------------------------------------------------+-------|
$^*$ In case the instructor delays in giving feedback, every group gets 10 bonus points.

*** Guidelines on intermediate detailed report
The report should have a clear roadmap of the activities being planned including the problem definition, governing equations, solution methodology, objectives of the study, and final deliverables.
*** Guidelines on the final report
The report should be organized as follows:
1) Introduction (including background and motivation for the chosen problem)
2) Literature Review (a brief review of recent literature dealing with the chosen problem)
3) Theoretical Formulation (details of governing equations - PDE and weak/energy form, discretization)
4) Verification/validation (to demonstrate the accuracy of the solution approach)
5) Numerical studies (e.g. to show effects of parameters, discussions on physical behavior)
6) Conclusions (summary of main findings of the study)
7) References

** Following are the titles of some projects done in previous years
- Free Vibration Of Thin Plates
- Finite Element Modelling of Thermal Management Systems of Laptops for effectiveness analysis
- Analysis of Cold Rolling process using Finite Element Analysis in Ansys Workbench
- Static Analysis of Leaf and Coil Spring
- Design and Analysis of Rolling Process
- Thermal expansion and Stress analysis of the Radial Turbine
- Modelling Reaction in Batch Reactor


* Calendar (tentative)
** [L1] Jan 05, Mon
- Introduction to FEM
- Different formulations of the same physical problem
- Stretching of 1D bar - force equilibrium, virtual work method, total potential energy
- Notion of strong and weak forms
** Jan 08, Thu - no class
- Class times rescheduled.
** [L2] Jan 13, Tue
- Matlab session.
** [L3] Jan 15, Thu
- Matlab session.
** [L4] Jan 20, Tue
- Stretching of 1D bar
  - Equivalence of virtual work and force equilibrium
- Function vs. functional
- Notion of dot product
- Fundamental lemma of calculus of variations
- Properties of virtual / weight functions
- Nomenclature of boundary conditions
** [L5] Jan 22, Thu
- Ritz method of solving weak form
- Ritz-Galerkin method
  - Sub-division of physical domain and domain integrals
  - Element-wise view vs. global view
- Shape functions / interpolation functions
  - global functions
  - piece-wise linear functions
  - Properties: Kronecker delta; partition of unity; localized nature
** [L6] Jan 27, Tue
- FE approach of solving the 1D weak form / virtual work formulation
- Approaches to enforce essential boundary conditions
- General process for utilizing FEM
- Reference element for element-level formulations
- Coordinate transformation jacobian and global formulation
- Gauss quadrature
** [L7] Jan 29, Thu
- Construction of 1D shape functions
- Error computations and convergence
- Computer implementation of 1D FEM
** [L8] Feb 03, Tue
- Computing weak form of 2D Poisson equation
** [L9] Feb 05, Thu
- Isoparametric bilinear element
** [L10] Feb 10, Tue
- Treatment of boundary integral in 2D problems
- Consideration of vector fields in 2D problems
** [L11] Feb 12, Thu
- Consideration of vector fields in 2D problems
** [L12] Feb 17, Tue
- Weak form for time-dependent problems
** [L13] Feb 19, Thu
- Weak form for time-dependent problems
** Feb 20 - 27: Mid semester exam week
** Feb 28 - Mar 8: Mid semester recess
** [L14] Mar 10, Tue
- Time-marching methods
** [L15] Mar 12, Thu
- 1D functionals and considering the energy formulations
- Minimization of functionals
** [L16] Mar 17, Tue
- 2D functionals
** [L17] Mar 19, Thu
- Locking behavior and issues with incompressible materials
- B-bar method
** [L18] Mar 24, Tue
- Variational principles
- Hu-Washizu variational principle
** [L19] Mar 26, Thu
- Shear locking in elasticity problems
** Mar 31, Tue - no class
- Maharvir Jayanti
