303.9_ES622_Spring2026.html


<div id="outline-container-orga3779ce" class="outline-3">
<h3 id="orga3779ce">Timeline</h3>
<div class="outline-text-3" id="text-orga3779ce">
<p>
Project is to be done in groups of not more than 3. Following timeline must be adhered to for all submissions. (this timeline will be updated during the first week of classes)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Task</th>
<th scope="col" class="org-right">Marks</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Feb 5</td>
<td class="org-left">Formation of groups, identification of topic. SUBMIT group details and abstract of proposed work.</td>
<td class="org-right">10</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Feb 19</td>
<td class="org-left">Feedback from instructor about project topics</td>
<td class="org-right">-10*</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Mar 19</td>
<td class="org-left">SUBMIT 2-3 page detailed report discussing overall approach, idealizations, etc. required for project</td>
<td class="org-right">20</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Apr 16</td>
<td class="org-left">Project presentations (one per group)</td>
<td class="org-right">30</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Apr 18</td>
<td class="org-left">SUBMIT final report.</td>
<td class="org-right">40</td>
</tr>
</tbody>
</table>
<p>
\(^*\) In case the instructor delays in giving feedback, every group gets 10 bonus points.
</p>
</div>

<div id="outline-container-orgab6bbab" class="outline-4">
<h4 id="orgab6bbab">Guidelines on intermediate detailed report</h4>
<div class="outline-text-4" id="text-orgab6bbab">
<p>
The report should have a clear roadmap of the activities being planned including the problem definition, governing equations, solution methodology, objectives of the study, and final deliverables.
</p>
</div>
</div>
<div id="outline-container-orgef27440" class="outline-4">
<h4 id="orgef27440">Guidelines on the final report</h4>
<div class="outline-text-4" id="text-orgef27440">
<p>
The report should be organized as follows:
</p>
<ol class="org-ol">
<li>Introduction (including background and motivation for the chosen problem)</li>
<li>Literature Review (a brief review of recent literature dealing with the chosen problem)</li>
<li>Theoretical Formulation (details of governing equations - PDE and weak/energy form, discretization)</li>
<li>Verification/validation (to demonstrate the accuracy of the solution approach)</li>
<li>Numerical studies (e.g. to show effects of parameters, discussions on physical behavior)</li>
<li>Conclusions (summary of main findings of the study)</li>
<li>References</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5505394" class="outline-3">
<h3 id="org5505394">Following are the titles of some projects done in previous years</h3>
<div class="outline-text-3" id="text-org5505394">
<ul class="org-ul">
<li>Free Vibration Of Thin Plates</li>
<li>Finite Element Modelling of Thermal Management Systems of Laptops for effectiveness analysis</li>
<li>Analysis of Cold Rolling process using Finite Element Analysis in Ansys Workbench</li>
<li>Static Analysis of Leaf and Coil Spring</li>
<li>Design and Analysis of Rolling Process</li>
<li>Thermal expansion and Stress analysis of the Radial Turbine</li>
<li>Modelling Reaction in Batch Reactor</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgb7a9a0b" class="outline-2">
<h2 id="orgb7a9a0b">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-orgb7a9a0b">
</div>
<div id="outline-container-org5ef4f7b" class="outline-3">
<h3 id="org5ef4f7b">[L1] Jan 05, Mon</h3>
<div class="outline-text-3" id="text-org5ef4f7b">
<ul class="org-ul">
<li>Introduction to FEM</li>
<li>Different formulations of the same physical problem</li>
<li>Stretching of 1D bar - force equilibrium, virtual work method, total potential energy</li>
<li>Notion of strong and weak forms</li>
</ul>
</div>
</div>
<div id="outline-container-orgb8c3306" class="outline-3">
<h3 id="orgb8c3306">Jan 08, Thu - no class</h3>
<div class="outline-text-3" id="text-orgb8c3306">
<ul class="org-ul">
<li>Class times rescheduled.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1d9db9" class="outline-3">
<h3 id="orgc1d9db9">[L2] Jan 13, Tue</h3>
<div class="outline-text-3" id="text-orgc1d9db9">
<ul class="org-ul">
<li>Matlab session.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf635335" class="outline-3">
<h3 id="orgf635335">[L3] Jan 15, Thu</h3>
<div class="outline-text-3" id="text-orgf635335">
<ul class="org-ul">
<li>Matlab session.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd45088" class="outline-3">
<h3 id="orgcd45088">[L4] Jan 20, Tue</h3>
<div class="outline-text-3" id="text-orgcd45088">
<ul class="org-ul">
<li>Stretching of 1D bar
<ul class="org-ul">
<li>Equivalence of virtual work and force equilibrium</li>
</ul></li>
<li>Function vs. functional</li>
<li>Notion of dot product</li>
<li>Fundamental lemma of calculus of variations</li>
<li>Properties of virtual / weight functions</li>
<li>Nomenclature of boundary conditions</li>
</ul>
</div>
</div>
<div id="outline-container-orgbfb2bba" class="outline-3">
<h3 id="orgbfb2bba">[L5] Jan 22, Thu</h3>
<div class="outline-text-3" id="text-orgbfb2bba">
<ul class="org-ul">
<li>Ritz method of solving weak form</li>
<li>Ritz-Galerkin method
<ul class="org-ul">
<li>Sub-division of physical domain and domain integrals</li>
<li>Element-wise view vs. global view</li>
</ul></li>
<li>Shape functions / interpolation functions
<ul class="org-ul">
<li>global functions</li>
<li>piece-wise linear functions</li>
<li>Properties: Kronecker delta; partition of unity; localized nature</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbde1227" class="outline-3">
<h3 id="orgbde1227">[L6] Jan 27, Tue</h3>
<div class="outline-text-3" id="text-orgbde1227">
<ul class="org-ul">
<li>FE approach of solving the 1D weak form / virtual work formulation</li>
<li>Approaches to enforce essential boundary conditions</li>
<li>General process for utilizing FEM</li>
<li>Reference element for element-level formulations</li>
<li>Coordinate transformation jacobian and global formulation</li>
<li>Gauss quadrature</li>
</ul>
</div>
</div>
<div id="outline-container-orga49f237" class="outline-3">
<h3 id="orga49f237">[L7] Jan 29, Thu</h3>
<div class="outline-text-3" id="text-orga49f237">
<ul class="org-ul">
<li>Construction of 1D shape functions</li>
<li>Error computations and convergence</li>
<li>Computer implementation of 1D FEM</li>
</ul>
</div>
</div>
<div id="outline-container-org26e1145" class="outline-3">
<h3 id="org26e1145">[L8] Feb 03, Tue</h3>
<div class="outline-text-3" id="text-org26e1145">
<ul class="org-ul">
<li>Computing weak form of 2D Poisson equation</li>
</ul>
</div>
</div>
<div id="outline-container-org4614d71" class="outline-3">
<h3 id="org4614d71">[L9] Feb 05, Thu</h3>
<div class="outline-text-3" id="text-org4614d71">
<ul class="org-ul">
<li>Isoparametric bilinear element</li>
</ul>
</div>
</div>
<div id="outline-container-org9e5d4e6" class="outline-3">
<h3 id="org9e5d4e6">[L10] Feb 10, Tue</h3>
<div class="outline-text-3" id="text-org9e5d4e6">
<ul class="org-ul">
<li>Treatment of boundary integral in 2D problems</li>
<li>Consideration of vector fields in 2D problems</li>
</ul>
</div>
</div>
<div id="outline-container-org7b0120b" class="outline-3">
<h3 id="org7b0120b">[L11] Feb 12, Thu</h3>
<div class="outline-text-3" id="text-org7b0120b">
<ul class="org-ul">
<li>Consideration of vector fields in 2D problems</li>
</ul>
</div>
</div>
<div id="outline-container-orgb83bff4" class="outline-3">
<h3 id="orgb83bff4">[L12] Feb 17, Tue</h3>
<div class="outline-text-3" id="text-orgb83bff4">
<ul class="org-ul">
<li>Weak form for time-dependent problems</li>
</ul>
</div>
</div>
<div id="outline-container-orgd514eec" class="outline-3">
<h3 id="orgd514eec">[L13] Feb 19, Thu</h3>
<div class="outline-text-3" id="text-orgd514eec">
<ul class="org-ul">
<li>Weak form for time-dependent problems</li>
</ul>
</div>
</div>
<div id="outline-container-org48f6289" class="outline-3">
<h3 id="org48f6289">Feb 20 - 27: Mid semester exam week</h3>
</div>
<div id="outline-container-org81b8629" class="outline-3">
<h3 id="org81b8629">Feb 28 - Mar 8: Mid semester recess</h3>
</div>
<div id="outline-container-org58063f1" class="outline-3">
<h3 id="org58063f1">[L14] Mar 10, Tue</h3>
<div class="outline-text-3" id="text-org58063f1">
<ul class="org-ul">
<li>Time-marching methods</li>
</ul>
</div>
</div>
<div id="outline-container-orgbbe4530" class="outline-3">
<h3 id="orgbbe4530">[L15] Mar 12, Thu</h3>
<div class="outline-text-3" id="text-orgbbe4530">
<ul class="org-ul">
<li>1D functionals and considering the energy formulations</li>
<li>Minimization of functionals</li>
</ul>
</div>
</div>
<div id="outline-container-org87cd06b" class="outline-3">
<h3 id="org87cd06b">[L16] Mar 17, Tue</h3>
<div class="outline-text-3" id="text-org87cd06b">
<ul class="org-ul">
<li>2D functionals</li>
</ul>
</div>
</div>
<div id="outline-container-orga0add21" class="outline-3">
<h3 id="orga0add21">[L17] Mar 19, Thu</h3>
<div class="outline-text-3" id="text-orga0add21">
<ul class="org-ul">
<li>Locking behavior and issues with incompressible materials</li>
<li>B-bar method</li>
</ul>
</div>
</div>
<div id="outline-container-org3f602c2" class="outline-3">
<h3 id="org3f602c2">[L18] Mar 24, Tue</h3>
<div class="outline-text-3" id="text-org3f602c2">
<ul class="org-ul">
<li>Variational principles</li>
<li>Hu-Washizu variational principle</li>
</ul>
</div>
</div>
<div id="outline-container-orgc77a877" class="outline-3">
<h3 id="orgc77a877">[L19] Mar 26, Thu</h3>
<div class="outline-text-3" id="text-orgc77a877">
<ul class="org-ul">
<li>Shear locking in elasticity problems</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf60bcb" class="outline-3">
<h3 id="orgaf60bcb">Mar 31, Tue - no class</h3>
<div class="outline-text-3" id="text-orgaf60bcb">
<ul class="org-ul">
<li>Maharvir Jayanti</li>
</ul>
</div>
</div>
